{
  "name": "Growing Crystals",
  "icon": "theurgy:terra_crystal",
  "category": "20_primitive_alchemy",
  "sortnum": 50,
  "pages": [
    {
      "type": "text",
      "text": "Now that we found a a very tangible and profitable use for alchemy, dissolving any items at hand into Essentia is becoming cumbersome. We need a $(bold)more efficient$() way of fueling our growing needs for Essentia. Another property of crystals might be of use to us in this pursuit: Crystals can be made to grow."
    },
    {
      "type": "text",
      "text": "It seems only logical that we should be able to make them grow in a way to profit us. The principle seems simple: Place a crystal down in the world, and $(bold)if the conditions fit$(), it will spread to nearby blocks. If we can make crystals hold raw Essentia and they grow, they should present an accessible source of raw Essentia."
    },
    {
      "type": "spotlight",
      "item": "theurgy:pure_crystal",
      "text": "Pure crystals can grow into other crystal types, under the right conditions. If all requirements are met and there are free adjacent blocks, new crystals will grow there after some time. Remember: $(italics)Patience is a virtue$()."
    },
    {
      "type": "text",
      "title": "Essentia Crystals",
      "text": "Our goal is clear: We want to gain more usable Essentia. We shall therefore attempt to create $(thing)crystals that hold only one type of Essentia$(). To this end, we need to create environments that encourage crystals to $(bold)draw in$() that one type of Essentia, and then grow."
    },
    {
      "type": "spotlight",
      "item": "theurgy:aer_crystal",
      "text": "In order to make a $(item)Aer Crystals$() grow, we need to expose it to Aer Essentia, while avoiding all other influences. Aer Crystals can have no more than 3 solid (non-crystal) blocks adjacent to them in any direction in order to grow. "
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/aer_crystal_growing.png"],
      "text": "Above you see a simple configuration that will eventually grow $(item)Aer Crystals$()."
    },
    {
      "type": "spotlight",
      "item": "theurgy:aqua_crystal",
      "text": "$(item)Aqua Crystals$() are quite easy to grow: place a crystal underwater, it will slowly start to grow Aqua Crystals."
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/aqua_crystal_growing.png"]
    },
    {
      "type": "spotlight",
      "item": "theurgy:ignis_crystal",
      "text": "$(item)Ignis Crystals$() need an adjacent heat source to grow. Fire, Lava and Magma come to mind."
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/ignis_crystal_growing.png"]
    },
    {
      "type": "spotlight",
      "item": "theurgy:terra_crystal",
      "text": "$(item)Terra Crystals$() only grow deep underground, at Y level 30 or lower. Additionally they can only grow on $(item)Obsidian$() blocks."
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/terra_crystal_growing.png"]
    },
    {
      "type": "text",
      "text": "Now you should be in possession of crystals of all four Essentia. Make sure to grow them and keep a steady supply, they are a most valuable source of Essentia."
    }
  ]
}