{
  "name": "Growing Crystals",
  "icon": "theurgy:terra_crystal",
  "category": "20_primitive_alchemy",
  "sortnum": 50,
  "pages": [
    {
      "type": "text",
      "text": "Теперь, когда мы нашли очень осязаемое и прибыльное применение для алхимии, растворение любых подручных предметов в эссенции становится обременительным. Нам нужен $(bold)more efficient$() способ удовлетворить наши растущие потребности в Эссенции. В этом стремлении нам может пригодиться еще одно свойство кристаллов: кристаллы можно заставить расти.."
    },
    {
      "type": "text",
      "text": "Кажется логичным, что мы должны иметь возможность заставить их расти так, чтобы приносить нам прибыль. Принцип кажется простым: поместите кристалл в мир и $(bold)if the conditions fit$(), он распространится на близлежащие блоки. Если мы сможем заставить кристаллы содержать сырую эссенцию и они будут расти, они должны быть доступным источником сырой эссенции."
    },
    {
      "type": "spotlight",
      "item": "theurgy:pure_crystal",
      "text": "Кажется, что чистые кристаллы не предъявляют никаких особых требований, так что положите один вниз. Если есть свободные соседние блоки, через некоторое время там вырастут новые кристаллы. Помнить: $(italics)Patience is a virtue$()."
    },
    {
      "type": "text",
      "title": "Essentia Crystals",
      "text": "Выращивание чистых кристаллов, безусловно, является достижением, но, к сожалению, само по себе не очень полезно. Наша цель ясна: мы хотим получить больше полезной Эссенции. Поэтому мы попытаемся создать $(thing)crystals that hold only one type of Essentia$(). Для этого нам нужно создать среду, которая побуждает кристаллы $(bold)draw in$() тот один вид Эссенции, а затем выращивать."
    },
    {
      "type": "spotlight",
      "item": "theurgy:aer_crystal",
      "text": "Чтобы сделать$(item)Aer Crystals$()расти, нам нужно подвергнуть его воздействию Aer Essentia (Эссенции Воздуха), избегая при этом всех других влияний. Кристаллы Воздуха могут иметь не более 3 твердых (некристаллических) блоков, смежных с ними в любом направлении для роста. "
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/aer_crystal_growing.png"],
      "text": "Выше вы видите простую конфигурацию, которая со временем будет расти $(item)Aer Crystals$()."
    },
    {
      "type": "spotlight",
      "item": "theurgy:aqua_crystal",
      "text": "$(item)Aqua Crystals$() их довольно легко выращивать: поместите кристалл под воду, он начнет медленно расти Водяной Кристалл."
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/aqua_crystal_growing.png"]
    },
    {
      "type": "spotlight",
      "item": "theurgy:ignis_crystal",
      "text": "$(item)Ignis Crystals$() для роста нужен соседний источник тепла. На ум приходят огонь, лава и магма."
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/ignis_crystal_growing.png"]
    },
    {
      "type": "spotlight",
      "item": "theurgy:terra_crystal",
      "text": "$(item)Terra Crystals$() растут только глубоко под землей, на уровне Y 30 или ниже. Кроме того, они могут расти только на $(item)Obsidian$() blocks."
    },
    {
      "type": "image",
      "images": ["theurgy:textures/gui/grimoire/terra_crystal_growing.png"]
    },
    {
      "type": "text",
      "text": "Теперь у вас должны быть кристаллы всех четырех эссенций. Обязательно выращивайте их и сохраняйте стабильные поставки, они являются наиболее ценным источником эссенции."
    }
  ]
}